==================
Single declaration
==================

signal a

---

(source_file
  (declaration
    (identifier)))

==================
Single declaration width
==================

signal a: 5

---

(source_file
  (declaration
    (signal_definition
      (identifier)
      (number))))

==================
Double declaration
==================

signal a, b

---

(source_file
  (declaration
    (declaration_left_list
      (identifier)
      (identifier))))

==================
Double declaration one width
==================

signal a: 5, b

---

(source_file
  (declaration
    (declaration_left_list
      (signal_definition
        (identifier)
        (number))
      (identifier))))

==================
Double declaration both width
==================

signal a: 5, b: 6

---

(source_file
  (declaration
    (declaration_left_list
      (signal_definition
        (identifier)
        (number))
      (signal_definition
        (identifier)
        (number)))))

==================
Name containing all symbols
==================

signal Asdf_2fuoihvsni9p32

---

(source_file
  (declaration
    (identifier)))

==================
Many declarations
==================

signal Asdf_2fuoihvsni9p32, sldfkjdksjf23lr, fd23r32, fdskfj, fdsf, f322fdsf,
kdjlfs_, ___dlfkjsf, wfdksjfl

---

(source_file
  (declaration
    (declaration_left_list
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier))))

==================
Simple declaration and assignment
==================

signal a <= b

---

(source_file
  (declaration
    (identifier)
    (identifier)))

==================
Multiple output declaration and assignment
==================

signal a, b, d <= c

---

(source_file
  (declaration
    (declaration_left_list
      (identifier)
      (identifier)
      (identifier))
    (identifier)))

==================
Multiple input declaration
==================

signal a <= c, b, d

---

(source_file
  (declaration
    (identifier)
    (declaration_right_list
      (identifier)
      (identifier)
      (identifier))))

==================
Number input declaration
==================

signal a <= 0

---

(source_file
  (declaration
    (identifier)
    (number)))

==================
Multiple number input declaration
==================

signal a <= 0, 1, 2, 98, 123

---

(source_file
  (declaration
    (identifier)
    (declaration_right_list
      (number)
      (number)
      (number)
      (number)
      (number))))

==================
Number in left list
:error
==================

signal a, 1 <= c

---

==================
Expression in left list
:error
==================

signal a, b and c <= c

---
